# Inner and Outer Joins

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
import sqlalchemy
import ibm_db_sa
import pandas as pd

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
connection_string = "ibm_db_sa://nhr87395:n6k6mlj7x1f%408vs2@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB"

%sql $connection_string

DB2/LINUXX8664

'Connected: nhr87395@BLUDB'

### HR Database  
We will be working on a sample HR database. This HR database schema consists of 5 tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS and LOCATIONS. 

The following diagram shows the tables for the HR database with a few rows of sample data.

![](../data/hr_tables.jpg)

### Query 1A: Select the names and job start dates of all employees who work for the department number 5.

In [6]:
%%sql select E.F_NAME, E.L_NAME, J.START_DATE
        from (select * from EMPLOYEES where DEP_ID=5) E inner join JOB_HISTORY J
        on E.EMP_ID = J.EMPL_ID

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

### Query 1B: Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [7]:
%%sql select E.F_NAME, E.L_NAME, J.START_DATE, T.JOB_TITLE
        from (select * from EMPLOYEES where DEP_ID=5) E 
        inner join JOB_HISTORY J on E.EMP_ID = J.EMPL_ID
        inner join JOBS T on E.JOB_ID = T.JOB_IDENT

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1), 'Sr. Software Developer'),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), 'Jr.Software Developer'),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), 'Jr.Software Developer'),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), 'Sr. Designer')]

### Query 2A: Perform a Left Outer Join on the EMPLOYEES and DEPARTMENTS tables and select employee id, last name, department id and department name for all employees.

In [12]:
%%sql select E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
        from EMPLOYEES E left join DEPARTMENTS D
        on E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', 'Software Group'),
 ('E1004    ', 'Kumar', '5        ', 'Software Group'),
 ('E1005    ', 'Hussain', '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', 'Design Team'),
 ('E1009    ', 'Jones', '7        ', 'Design Team'),
 ('E1010    ', 'Jacob', '5        ', 'Software Group')]

### Query 2B: Re-write the query for 2A to limit the result set to include only the rows for employees born before 1980.

In [19]:
%%sql select E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
        from EMPLOYEES E left join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP
        where year(E.B_DATE) < 1980

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team')]

### Query 2C: Re-write the query for 2A to have the result set include all the employees but department names for only the employees who were born before 1980.

In [20]:
%%sql select E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
        from EMPLOYEES E left join DEPARTMENTS D
        on E.DEP_ID = D.DEPT_ID_DEP and year(E.B_DATE) < 1980

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', None),
 ('E1004    ', 'Kumar', '5        ', None),
 ('E1005    ', 'Hussain', '2        ', None),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', None),
 ('E1009    ', 'Jones', '7        ', None),
 ('E1010    ', 'Jacob', '5        ', None)]

### Query 3A: Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [21]:
%%sql select E.F_NAME, E.L_NAME, D.DEP_NAME
        from EMPLOYEES E full join DEPARTMENTS D
        on E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

### Query 3B: Re-write Query 3A to have the result set include all employee names but department id and department names only for male employees.

In [23]:
%%sql select E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
        from EMPLOYEES E left join DEPARTMENTS D
        on E.DEP_ID = D.DEPT_ID_DEP and E.SEX = 'M'

 * ibm_db_sa://nhr87395:***@dashdb-txn-sbox-yp-lon02-13.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', '2        ', 'Architect Group'),
 ('Alice', 'James', None, None),
 ('Steve', 'Wells', '5        ', 'Software Group'),
 ('Santosh', 'Kumar', '5        ', 'Software Group'),
 ('Ahmed', 'Hussain', '2        ', 'Architect Group'),
 ('Nancy', 'Allen', None, None),
 ('Mary', 'Thomas', None, None),
 ('Bharath', 'Gupta', '7        ', 'Design Team'),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None)]